use init_db;

-- Додавання працівників
insert into worker (NAME, BIRTHDAY, LEVEL, SALARY)
values
('John', '1990-01-01', 'Trainee', 800),
('Alice', '1985-05-15', 'Junior', 1200),
('Chris', '1982-07-18', 'Trainee', 900),
('Jessica', '1992-09-25', 'Junior', 1100),
('David', '1988-12-12', 'Middle', 2800),
('Sophia', '1998-04-30', 'Senior', 7000),
('Michael', '1987-06-28', 'Trainee', 950),
('Olga', '2000-05-28', 'Junior', 950),
('Artur', '1999-12-28', 'Junior', 950),
('Olivia', '1993-11-03', 'Junior', 1300);

-- Додавання клієнтів
insert into client (NAME)
values
('Oleg'),
('Alina'),
('Anton'),
('Vladislav'),
('Christina');

-- Додавання проєктів
insert into project (CLIENT_ID, START_DATE, FINISH_DATE)
values
(1, '2020-01-01', '2021-03-31'),
(2, '2022-02-15', '2022-06-30'),
(3, '2022-03-10', '2022-05-15'),
(4, '2022-04-20', '2022-07-15'),
(5, '2022-05-05', '2022-08-31'),
(1, '2022-06-15', '2023-09-30'),
(2, '2022-07-01', '2023-08-31'),
(3, '2022-08-15', '2023-11-30'),
(4, '2022-09-10', '2024-01-31'),
(5, '2022-10-05', '2024-02-28');

-- Додавання працівників до проєктів
insert into project_worker (PROJECT_ID, WORKER_ID)
values
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(1, 5),
(2, 6),
(2, 7),
(2, 8),
(2, 9),
(2, 10),
(3, 1),
(3, 2),
(3, 3),
(3, 4),
(4, 5),
(4, 6),
(4, 7),
(5, 8),
(5, 9),
(5, 10),
(6, 1),
(6, 2);